TheComet/bat6/software/unit-tests/dspic_emulation/src/p33EP16GS506.cpp
volatile unsigned int  TRISA;
volatile TRISABITS TRISAbits;
volatile unsigned int  PORTA;
volatile PORTABITS PORTAbits;
volatile unsigned int  LATA;
volatile LATABITS LATAbits;
volatile unsigned int  ODCA;
volatile ODCABITS ODCAbits;
volatile unsigned int  CNENA;
volatile CNENABITS CNENAbits;
volatile unsigned int  CNPUA;
volatile CNPUABITS CNPUAbits;
volatile unsigned int  CNPDA;
volatile CNPDABITS CNPDAbits;
volatile unsigned int  ANSELA;
volatile ANSELABITS ANSELAbits;
volatile unsigned int  TRISB;
volatile TRISBBITS TRISBbits;
volatile unsigned int  PORTB;
volatile PORTBBITS PORTBbits;
volatile unsigned int  LATB;
volatile LATBBITS LATBbits;
volatile unsigned int  ODCB;
volatile ODCBBITS ODCBbits;
volatile unsigned int  CNENB;
volatile CNENBBITS CNENBbits;
volatile unsigned int  CNPUB;
volatile CNPUBBITS CNPUBbits;
volatile unsigned int  CNPDB;
volatile CNPDBBITS CNPDBbits;
volatile unsigned int  ANSELB;
volatile ANSELBBITS ANSELBbits;
volatile unsigned int  TRISC;
volatile TRISCBITS TRISCbits;
volatile unsigned int  PORTC;
volatile PORTCBITS PORTCbits;
volatile unsigned int  LATC;
volatile LATCBITS LATCbits;
volatile unsigned int  ODCC;
volatile ODCCBITS ODCCbits;
volatile unsigned int  CNENC;
volatile CNENCBITS CNENCbits;
volatile unsigned int  CNPUC;
volatile CNPUCBITS CNPUCbits;
volatile unsigned int  CNPDC;
volatile CNPDCBITS CNPDCbits;
volatile unsigned int  ANSELC;
volatile ANSELCBITS ANSELCbits;
volatile unsigned int  TRISD;
volatile TRISDBITS TRISDbits;
volatile unsigned int  PORTD;
volatile PORTDBITS PORTDbits;
volatile unsigned int  LATD;
volatile LATDBITS LATDbits;
volatile unsigned int  ODCD;
volatile ODCDBITS ODCDbits;
volatile unsigned int  CNEND;
volatile CNENDBITS CNENDbits;
volatile unsigned int  CNPUD;
volatile CNPUDBITS CNPUDbits;
volatile unsigned int  CNPDD;
volatile CNPDDBITS CNPDDbits;
volatile unsigned int  ANSELD;
volatile ANSELDBITS ANSELDbits;
volatile unsigned int  _APPO;
volatile unsigned int  _APPIN;
volatile unsigned int  APPS;
volatile APPSBITS APPSbits;
volatile unsigned int  STROUTL;
volatile unsigned int  STROUTH;
volatile unsigned int  STROVCNT;
volatile unsigned int  JDATAH;
volatile unsigned int  JDATAL;
unsigned int _FSEC;
unsigned int _FBSLIM;
unsigned int _FSIGN;
unsigned int _FOSCSEL;
unsigned int _FOSC;
unsigned int _FWDT;
unsigned int _FPOR;
unsigned int _FICD;
unsigned int _FDEVOPT;
unsigned int _FALTREG;
